{
  "jobs": [
    {
      "id": "1",
      "jobTitle": "Software Developer",
      "company": "XYZ Corp",
      "locations": [
        "New York",
        "London",
        "Tokyo"
      ],
      "shortDescription": "Join us as a software developer to build amazing products.",
      "description": "<p>XYZ Corp is looking for a skilled software developer to work on modern web applications. The ideal candidate should be proficient in JavaScript, React, and Node.js, with a strong problem-solving mindset and the ability to collaborate with cross-functional teams. Responsibilities include designing, coding, testing, and deploying scalable software solutions.</p>",
      "skills": [
        "JavaScript",
        "React",
        "Node.js"
      ],
      "salaryRangeMin": 60000,
      "salaryRangeMax": 90000,
      "experienceMin": 1,
      "experienceMax": 3
    },
    {
      "id": "2",
      "jobTitle": "Frontend Developer",
      "company": "ABC Corp",
      "locations": [
        "Los Angeles"
      ],
      "shortDescription": "Seeking a frontend developer to create beautiful user interfaces.",
      "description": "ABC Corp is looking for a talented frontend developer who is passionate about building high-quality web applications. The role involves developing responsive UI components using HTML, CSS, and JavaScript while collaborating with designers and backend developers to enhance user experience. A deep understanding of performance optimization and accessibility is a plus.",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "salaryRangeMin": 50000,
      "salaryRangeMax": 80000,
      "experienceMin": 1,
      "experienceMax": 4
    },
    {
      "id": "3",
      "jobTitle": "Backend Developer",
      "company": "123 Corp",
      "locations": [
        "Chicago"
      ],
      "shortDescription": "Backend developer needed to build and maintain APIs.",
      "description": "123 Corp is looking for a backend developer to design and implement robust, scalable, and secure APIs. The candidate should have experience working with Node.js, Express, and MongoDB, and should be familiar with microservices architecture. Responsibilities include developing server-side logic, optimizing database queries, and ensuring system security.",
      "skills": [
        "Node.js",
        "Express",
        "MongoDB"
      ],
      "salaryRangeMin": 70000,
      "salaryRangeMax": 100000,
      "experienceMin": 2,
      "experienceMax": 5
    },
    {
      "id": "4",
      "jobTitle": "Fullstack Developer",
      "company": "456 Corp",
      "locations": [
        "San Francisco"
      ],
      "shortDescription": "Looking for a fullstack developer to work on end-to-end development.",
      "description": "456 Corp is hiring a fullstack developer to build and maintain full-fledged applications. The ideal candidate should have experience with both frontend (React) and backend (Node.js) technologies. The role involves working with designers, product managers, and other engineers to develop high-quality software solutions. A strong understanding of GraphQL and cloud technologies is desirable.",
      "skills": [
        "React",
        "Node.js",
        "GraphQL"
      ],
      "salaryRangeMin": 80000,
      "salaryRangeMax": 120000,
      "experienceMin": 3,
      "experienceMax": 6
    },
    {
      "id": "5",
      "jobTitle": "DevOps Engineer",
      "company": "789 Corp",
      "locations": [
        "Seattle"
      ],
      "shortDescription": "Seeking a DevOps Engineer to improve CI/CD and cloud infrastructure.",
      "description": "<p>789 Corp is looking for a DevOps Engineer to automate deployments, manage cloud infrastructure, and optimize performance. The ideal candidate should be experienced with AWS, Docker, and Kubernetes, and be comfortable working with CI/CD pipelines. Responsibilities include monitoring system performance, improving scalability, and ensuring security best practices are followed.</p>",
      "skills": [
        "AWS",
        "Docker",
        "Kubernetes"
      ],
      "salaryRangeMin": 90000,
      "salaryRangeMax": 130000,
      "experienceMin": 3,
      "experienceMax": 7
    },
    {
      "id": "08e338c3-19dd-4686-b8db-0a16a5d773c5",
      "jobTitle": "SWE Intern",
      "company": "Company",
      "locations": [
        "Coimbatore"
      ],
      "shortDescription": "Internship opportunity for software engineering students.",
      "description": "We are offering an internship opportunity for students or recent graduates who want hands-on experience in software development. As an intern, you will work on real-world projects, contribute to our software stack, and collaborate with experienced developers. Ideal candidates should be eager to learn, have basic programming skills, and be comfortable working in a team.",
      "skills": [
        "Java",
        "Spring Boot",
        "SQL"
      ],
      "salaryRangeMin": 20000,
      "salaryRangeMax": 30000,
      "experienceMin": 0,
      "experienceMax": 1
    },
    {
      "id": "ce677a7c-f278-4f3a-bd06-46b79f2ddac9",
      "jobTitle": "SWE Intern",
      "company": "Company",
      "locations": [
        "Coimbatore"
      ],
      "shortDescription": "Exciting internship for students interested in software engineering.",
      "description": "<p>This software engineering internship provides an opportunity to gain real-world experience by working on live projects under the guidance of experienced developers. Interns will participate in coding tasks, debugging, and feature implementation, and will receive mentorship throughout the internship period.</p>",
      "skills": [
        "Python",
        "Django",
        "REST API"
      ],
      "salaryRangeMin": 20000,
      "salaryRangeMax": 30000,
      "experienceMin": 0,
      "experienceMax": 1
    }
  ],
  "savedJobs": []
}